/* 1. с помощью prompt() получить от пользователя два числа. Сравнить два числа. Вывести в консоль 1 если первое число больше чем второе. Вывести в консоль 0 если первое число меньше второго. */

/*var a = prompt('введите первое число');
var b = prompt('введите второе число'); 
if (a > b){
    console.log(1);
}
else {
    console.log(0);
}*/

/* 2. Получить от пользователя три числа и вывести среднее арифметическое этих чисел в консоль*/

/* var a = prompt('введите первое число');
var b = prompt('введите второе число'); 
var c = prompt('введите третье число'); 
var result = (Number(a) + Number(b) + Number(c))/3;
console.log(result); */

/* 3. Получить от пользователя его имя и возраст. Вывести в консоль сообщение вида «Hello USER_NAME, you are AGE years old”. (большими буквами написаны переменные из которых должны браться значение».*/

 var name = prompt('Имя');
var age = prompt('Возраст');
console.log('Hello ' + name + ', you are ' + age + ' years old'); 
